{
  "model_type": "bert",
  "architectures": ["BertForSequenceClassification"],
  "vocab_size": 83828,
  "hidden_size": 312,
  "num_hidden_layers": 3,
  "num_attention_heads": 12,
  "intermediate_size": 600,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "attention_probs_dropout_prob": 0.1,
  "max_position_embeddings": 2048,
  "type_vocab_size": 2,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "use_cache": true,
  "num_labels": 5,
  "id2label": {"0": "мода", "1": "технологии", "2": "финансы", "3": "крипта", "4": "спорт"},
  "label2id": {"мода": 0, "технологии": 1, "финансы": 2, "крипта": 3, "спорт": 4}
}